<template>
  <section class='FAQ'>
    <div class='container'>
      <div class='title'>
        <h2>FAQ</h2>
        <h3>Питання та відповіді</h3>
      </div>
      <ol>
        <li v-for='(item, index) in faqList' :key='index'>
          <strong>{{ item.question }}</strong><br>
          {{ item.answer }}
        </li>
      </ol>
    </div>
  </section>
</template>

<script>
export default {
  data() {
    return {
      faqList: [
        {
          question: 'Що таке ваша компанія і чим ви займаєтеся?',
          answer: 'Ми є компанією, яка спеціалізується на [опис діяльності компанії].'
        },
        {
          question: 'Які переваги використання ваших продуктів або послуг?',
          answer: 'Наші продукти/послуги пропонують такі переваги як [перелік переваг, наприклад, висока якість, ' +
              'конкурентні ціни, інноваційні рішення тощо].'
        },
        {
          question: 'Як зв`язатися з вашою службою підтримки клієнтів?',
          answer: 'Ви можете зв\'язатися з нашою службою підтримки клієнтів [зазначте способи зв\'язку, наприклад,' +
              ' електронна пошта, телефон, онлайн-чат].'
        },
        {
          question: 'Як здійснити повернення товару або отримати повернення коштів',
          answer: 'Інформація про процедуру повернення товару та повернення коштів доступна на сторінці' +
              ' [посилання на сторінку з політикою повернень].'
        },
        {
          question: 'Чи є у вас програма лояльності для постійних клієнтів?',
          answer: 'Так, ми маємо програму лояльності, деталі якої можна знайти на сторінці [посилання на сторінку' +
              ' з інформацією про програму лояльності].'
        },
        {
          question: 'Як я можу відстежувати стан мого замовлення?',
          answer: 'Ви можете відстежувати стан вашого замовлення у розділі \'Мої замовлення\' на нашому сайті,' +
              ' а також ми надсилатимемо вам оновлення на вашу електронну пошту.'
        },
        {
          question: 'Чи приймаєте ви різні методи оплати?',
          answer: 'Ми приймаємо різні методи оплати, включаючи [перелік методів оплати, наприклад, кредитні картки,' +
              ' PayPal, банківські перекази тощо].'
        },
        {
          question: 'Як довго триває доставка?',
          answer: 'Час доставки залежить від вашого місця розташування і обраного способу доставки. Зазвичай доставка ' +
              'займає від [час доставки, наприклад, 2-5 робочих днів].'
        },
      ]
    };
  }
};
</script>